[
  {
    "id": "1",
    "title": "Hades II - Nintendo Switch™ 2 Edition",
    "coverPhoto": "https://i.postimg.cc/1t38WZWM/game5.avif",
    "category": "Action RPG",
    "downloadLink": "https://www.nintendo.com/store/products/hades-ii-switch",
    "description": "In Hades II, players return to the fiery depths of the Underworld to face the Titan of Time. As Melinoë, the Princess of the Underworld, you'll wield dark magic and powerful weapons while mastering fast-paced combat against hordes of mythic enemies. With new gods, upgraded visuals, and a branching story that reacts to your choices, this sequel expands every part of the original game. The Nintendo Switch™ 2 Edition delivers smoother performance, enhanced particle effects, and exclusive content, including time-based trials and divine armor sets.",
    "ratings": "4.9",
    "developer": "Supergiant Games",
    "releaseDate": "2025-04-12",
    "platforms": ["Nintendo Switch 2", "PC", "PlayStation 5"],
    "modes": ["Single-player"],
    "price": "$39.99",
    "ageRating": "T (Teen)"
  },
  {
    "id": "2",
    "title": "Kirby Air Riders",
    "coverPhoto": "https://i.postimg.cc/qBmRvYmg/game2.avif",
    "category": "Racing / Action",
    "downloadLink": "https://www.nintendo.com/store/products/kirby-air-riders-switch",
    "description": "Kirby Air Riders returns in an exciting remake designed for the Nintendo Switch 2! Race across colorful Dream Land tracks using iconic Warp Stars, unlock powerful abilities mid-race, and challenge your friends in high-speed battles. Players can glide, dash, and spin their way to victory while collecting stars and power-ups scattered throughout dynamic maps. Featuring new co-op challenges, online multiplayer, and performance upgrades, this edition captures the nostalgic fun of the GameCube classic while adding modern mechanics and fresh visual flair.",
    "ratings": "4.6",
    "developer": "HAL Laboratory",
    "releaseDate": "2025-06-30",
    "platforms": ["Nintendo Switch 2"],
    "modes": ["Single-player", "Multiplayer"],
    "price": "$49.99",
    "ageRating": "E (Everyone)"
  },
  {
    "id": "3",
    "title": "Metroid Prime™ 4: Beyond - Nintendo Switch 2 Edition",
    "coverPhoto": "https://i.postimg.cc/WzrT8WP9/game4.avif",
    "category": "Sci-Fi Adventure / FPS",
    "downloadLink": "https://www.nintendo.com/store/products/metroid-prime-4-switch",
    "description": "Samus Aran returns in Metroid Prime 4: Beyond — a breathtaking sci-fi epic that blends atmospheric exploration with high-intensity combat. Trapped on the mysterious planet Viewros, Samus must uncover lost Chozo technology and confront a new cosmic threat. Powered by the Switch 2's enhanced hardware, the game features dynamic lighting, immersive soundscapes, and seamless world transitions. Players can customize their suit upgrades and engage in large-scale boss battles that redefine the first-person adventure experience.",
    "ratings": "4.8",
    "developer": "Nintendo EPD / Retro Studios",
    "releaseDate": "2025-09-10",
    "platforms": ["Nintendo Switch 2"],
    "modes": ["Single-player"],
    "price": "$59.99",
    "ageRating": "T (Teen)"
  },
  {
    "id": "4",
    "title": "Mario Kart™ World",
    "coverPhoto": "https://i.postimg.cc/YCrmsgyk/game1.avif",
    "category": "Racing / Multiplayer",
    "downloadLink": "https://mariokartworld.nintendo.com",
    "description": "Mario Kart™ World brings the most ambitious kart racing experience ever created. Travel across a massive open world connecting famous tracks from Mushroom Kingdom, Bowser's Castle, and Rainbow Road. Choose from over 30 characters, customize your karts, and race through online tournaments with players around the globe. The Switch 2 Edition introduces a new world map, weather effects, and real-time terrain changes. With cross-play support and live events, Mario Kart World redefines racing for the next generation.",
    "ratings": "4.9",
    "developer": "Nintendo EPD",
    "releaseDate": "2025-05-20",
    "platforms": ["Nintendo Switch 2", "Mobile"],
    "modes": ["Single-player", "Multiplayer", "Online"],
    "price": "Free-to-Play (In-App Purchases)",
    "ageRating": "E (Everyone)"
  },
  {
    "id": "5",
    "title": "Hyrule Warriors: Age of Imprisonment",
    "coverPhoto": "https://i.postimg.cc/wvR1Kkph/game6.avif",
    "category": "Action / Hack and Slash",
    "downloadLink": "https://zelda.nintendo.com/hyrule-warriors",
    "description": "Experience the untold battle for Ancient Hyrule in Hyrule Warriors: Age of Imprisonment. Command armies of legendary heroes like Princess Zelda, King Rauru, and Ganondorf in massive, action-packed battles. The game's cinematic story bridges the events between Tears of the Kingdom and Ocarina of Time. With real-time combat, strategic mechanics, and stunning visuals, this installment captures both the chaos and the heart of war. Switch 2 enhancements include larger maps, improved AI, and a seamless co-op mode for two players.",
    "ratings": "4.7",
    "developer": "Omega Force / Koei Tecmo",
    "releaseDate": "2025-07-15",
    "platforms": ["Nintendo Switch 2"],
    "modes": ["Single-player", "Co-op"],
    "price": "$59.99",
    "ageRating": "T (Teen)"
  },
  {
    "id": "6",
    "title": "Hollow Knight: Silksong - Nintendo Switch 2 Edition",
    "coverPhoto": "https://i.postimg.cc/056QrnhS/game3.avif",
    "category": "Action / Adventure / Metroidvania",
    "downloadLink": "https://www.teamcherry.com.au/silksong",
    "description": "Hollow Knight: Silksong invites players to embark on a hauntingly beautiful journey as Hornet, princess-protector of Hallownest. Explore new kingdoms teeming with mysterious insects, hidden temples, and deadly traps. With elegant combat, precise platforming, and an emotional orchestral soundtrack, Silksong deepens the lore and artistry of its predecessor. The Nintendo Switch 2 Edition features faster load times, richer animations, and exclusive DLC quests. Every enemy defeated and every secret uncovered draws you closer to uncovering Hornet's fate.",
    "ratings": "4.9",
    "developer": "Team Cherry",
    "releaseDate": "2025-03-22",
    "platforms": ["Nintendo Switch 2", "PC", "PlayStation 5"],
    "modes": ["Single-player"],
    "price": "$29.99",
    "ageRating": "E10+ (Everyone 10+)"
  }
]
